# 2) მომხმარებელს შემოატანინე 5 რიცხვი და დაბეჭდეთ მათი ნამრავლი
# number=0

# while number < 5:
#      print(number)
#      number = number + 1

# 3) დაბეჭდეთ 50-დან 10-ის ჩათვლით ყოველი მეორე რიცხვი.
for i in range(50, 10, -2):
     print(i)
# 4) შექმენით პროგრამა, სადაც მომხმარებელი გამოიცნობს ჩაფიქრებულ რიცხვს 1-დან 10-ის ჩათვლით.
# დაგჭირდებათ ცვლადი, სადაც შეინახავთ ნებისმიერ რიცხვს 1-დან 10-მდე(ეს იქნება ჩაფიქრებული რიცხვი).
# while loop-ის გამოყენებით მომხმარებელს იქამდე შემოატანინეთ რიცხვი სანამ არ გამოიცნობს. მომხმარებელს ექნება 3 ცდა ჩაფიქრებული რიცხვის გამოსაცნობად. ყოველი არასწორი რიცხვის შეყვანისას დაბეჭდეთ "Wrong number" და აცნობეთ მომხმარებელს რამდენი ცდა დარჩა. თუ გამოიცნო, გათიშეთ while ციკლი და დაბეჭდეთ You win, ხოლო თუ ცდები ამოეწურა ასევე გათიშეთ while ციკლი და დაბეჭდეთ "You lose"


number=10
attempt=3

while attempt >0:
    guess=int(input("შეიყვანე რიცხვი 1 დან 10 ის ჩათვლით :"))
    if guess==number:
        print("you win")
    else:
        attempt-=1 
        if attempt>0:
            print("wrong number")
        else:
            print("you lose")    
     