# 1) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს
list=[
    "BMW",
    "TOYOTA",
    "MUSTANG"
]
print(list)
# 2) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს
number=[
    0,
    2,
    4,
    6,
    8,
    10
]
print(number)
# 3) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი
my_list = [10, 20, 30, 40, 50]
print(my_list[3])  # ინდექსები იწყება 0-დან, ანუ მე-4 ელემენტი არის ინდექსზე 3

# 4) იგივე სიის მე-3 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით და დაბეჭდეთ მთლიანი სია.
my_list[3] = "ანა"
print(my_list)

# 5) შექმენით 3 ელემენტიანი რიცხვების სია და დაბეჭდეთ პირველი და ბოლო ელემენტთა ჯამი
numbers = [5, 15, 25]
sum_result = numbers[0] + numbers[2]  # პირველი ინდექსზე 0, ბოლო - 2
print(sum_result)
