# 1) შექმენით 3 ელემენტიანი სახელების სია. მომხმარებელს შემოატანინეთ 0-დან 2-ის ჩათვლით ნებისმიერი რიცხვი, სანამ მომხმარებელი არ შემოიტანს რიცხვს საჭირო დიაპაზონში, ხელახლა ვთხოვოთ რიცხვის შემოტანა.(გამოიყენეთ while loop-ი)

# დაბეჭდეთ სახელების სიაში მომხმარებლის მიერ შემოტანილ ინდექსზე მყოფი ელემენტი
name = ["anano","nini","lika"]
index = int(input("Please enter a number(0-2): "))

while index < 0 or index > 2:
    print("The number out of range")
    index = int(input("Please enter a number(0-2): "))

print(name[index])
# 2) რატომ გამოიტანს ეს კოდი შეცდომას?

# word = "Python"
# word[0] = "B"
# print(word)

# ახსენით კომენტარით


#ეს errors  გამოიტანს იმიტომ რომ არ შეგვიძლია სტრინგის შეცვლა 

# 3) შექმენით 10 ელემენტიანი რიცხვების სია და slicing-ის გამოყენებით დაბეჭდეთ ყოველი მესამე ელემენტი ამ სიაში
#     0 1 2 3 4 5 6 7 8 9
nums=[1,2,3,4,5,6,7,8,9,10]
print(nums[::3])
# 4) slicing-ის გამოყენებით. იგივე სიიდან დაბეჭდეთ მე-4, მე-7 და მე-10 ელემენტები
print(nums[3::3])