#თქვენი სიტყვებით ახსენით, თუ რა არის დეკლარაცია, ინიციალიზება და რეინიციალიზება.

#დეკლარაცია არის ცვლადის გამოცხადება ანუ მისი შექმნა პროგრამაში. 
#ინიციალიზება არის ცვლადისთვის საწყისი მნიშვნელობის მინიჭება. 
#რეინიციალიზება არის უკვე ინიციალიზებული ცვლადის მნიშვნელობის შეუცვალა. 



# შექმენით ცვლადი, შეუცვალეთ მას მნიშვნელობა 3-ჯერ. თითოეული მნიშვნელობის შეცვლის შემდეგ დაბეჭდეთ ეს ცვლადი. 


varible="5"

print(varible)


varible="10"

print(varible)


varible="15"

print(varible)



# შექმენით 5 ცვლადი, სადაც შეინახავთ რიცხვებს. დაბეჭდეთ მათი ჯამი print ფუნქციის გამოყენებით.

num1= 2
num2= 4
num3= 6
num4= 10
num5=90

print(num1+num2+num3+num4+num5)

#მართკუთხედის პერიმეტრი:
#შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაბეჭდეთ.


width=10
length=20

perimeter=((20+10))*2

print(perimeter)