#2) კომენტარებით ახსენით რა არის for ციკლი, საიტერაციო ცვლადი და range ფუნქცია
# # for ციკლი საშუალებას გვაძლევს გარკვეული კოდი გავუშვათ განმეორებით რამდენჯერმე
# ამ მაგალითში "i" არის საიტერაციო ცვლადი იგი ცვლის მნიშვნელობას ყოველ გამეორებაზე
# range ფუნქცია ქმნის რიცხვების მიმდევრობას

for i in range(5):  # ეს კოდი გაიშვება 5-ჯერ, i იქნება 0, 1, 2, 3 და 4
    print(i)  # დაბეჭდავს i-ს ყოველი გამეორებისას

#3) დაბეჭდეთ 0-დან 50-ის ჩათვლით ყველა რიცხვი for ციკლის გამოყენებით
for i in range(50):
    print(i)
#4) მომხმარებელს შემოატანინეთ 5 რიცხვი for ციკლის გამოყენებით და დაბეჭდეთ მათი საშუალო არითმეტიკული.

total = 0

for i in range(5):
    number = float(input(f"{i+1}) შეიყვანე რიცხვი: "))  
    total += number  
average = total / 5
print("შეყვანილი რიცხვების საშუალო არითმეტიკულია:", average)

