# თქვენი სიტყვებით ახსენით რა არის debugging და რამდენი ნაწილისგან შედგება, ასევე ამ საკითხზე გააკეთეთ ნახაზი paint-ში

# debugging არის პროგრამაში არსებული შეცდომების აღმოჩენა.

# შექმენით ერთი ცვლადი, რომელსაც 5-ჯერ შეუცვლით მნიშვნელობას და საბოლოოდ დაბეჭდავთ მის მნიშვნელობას

x=10
x=20
x=30
x=40
x=50
print(x)

# თქვენი სიტყვებით ახსენით რას ნიშნავს case-sensitive და case-insensitive

# case-sensitive  ასოებს გაბსხვავებას აქვს მნიშვნელობა.
# case-insensitive ასოებს შორის  განსხვავებას არ აქვს მნიშვნელობა.