#თქვენი სიტყვებით ახსენით, თუ რა არის დეკლარაცია, ინიციალიზება და რეინიციალიზება.
#დეკლარაცია – ცვლადის გამოცხადება პროგრამაში, ანუ მისი შექმნა.
#ინიციალიზება – ცვლადის პირველადი მნიშვნელობის მინიჭება.
#რეინიციალიზება – ცვლადის უკვე მინიჭებული მნიშვნელობის შეცვლა ახალით.

#შექმენით ცვლადი, შეუცვალეთ მას მნიშვნელობა 3-ჯერ. თითოეული მნიშვნელობის შეცვლის შემდეგ დაბეჭდეთ ეს ცვლადი.
x = 5  
print(x)

x = 10  
print(x)

x = 15  
print(x)

# შექმენით 5 ცვლადი, სადაც შეინახავთ რიცხვებს. დაბეჭდეთ მათი ჯამი print ფუნქციის გამოყენებით.
a = 4
b = 7
c = 12
d = 9
e = 18
# მართკუთხედის პერიმეტრი:
#შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაბეჭდეთ.print(a + b + c + d + e)

length = 20
width = 10

perimeter = 2 * (length + width)
print(perimeter)
You sent
You unsent a message
You sent
#შექმენით 2 ცლვადი, პირველში შეინახეთ ტექსტური მონაცემი, მეორეში რიცხვითი მონაცემი
#გაიგეთ და დაებეჭდეთ მათი მონაცემთა ტიპი.

name="anano"

nom=15

print(type(name))
print(type(nom))