# 2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის(მოიყვანეთ მაგალითით შექმენით ნებისმიერი სია)
# სია (list) არის მონაცემთა სტრუქტურა, რომელიც საშუალებას გაძლევთ შეინახოთ ელემენტების ჯგუფი ერთ ცვლადში.

# სიაში შეიძლება იყოს რიცხვები, სტრინგები (ტექსტები), ლოგიკური მნიშვნელობები და სხვა სიებიც კი.

# სია ინიშნება კვადრატული ფრჩხილებით [ ] და ელემენტები გამოყოფილია მძიმით.

numbers = [10, 20, 30, 40, 50]
names = ["nino", "dato", "mari", "gio"]
print(names)

# 3) კომენტარებით ახსენით რა არის ინდექსი.
#index- არის რიცხვი, რომელიც მიუთითებს ელემენტის ადგილმდებარეობას სიაში.

# 4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა
list= [
   "anano",
   "mari",
   "lika",
   "lizi",
   "tako",
   "sopo",
   "niako"
]

list[1]=("natali")
list[5]=("nita")
print(list)

