#თქვენი სიტყვებით ახსენით რა არის string და integer. მოიყვანეთ მაგალითები.
#string არის ტექსტური მონაცემი რომელიც აღნიშნავს ტექსტებს მხლოდ რომელიც ინახება ბრჭყალებში მაგ:"hello world",'pytho'"123"
#integer არის მთელი რიცხვი რომელიც არ შეიცავს ათწილადს.


# შექმენით 3 ცვლადი სადაც შეინახავთ თქვენთვის სასურველ მონაცემს. type ფუნქციის გამოყენებით დაბეჭდეთ მათი ტიპი.

name="anano"
age=15
height=1.70
print(name)
print(age)
print(height)


#ახსენით რა არის კონკადინაცია(თუ არ იცით, მოიძიეთ) და მოიყვანეთ მისი მაგალითი.
#კონკადინაცია არის ორი ან მეტი string-ის გაერთიანება python-ში ამისთვის + ოპერატორს ვიყენებთ

#მაგ: 
first_name="anano"
last_name="tsagareishvili"
full_name=first_name + " " + last_name
print(full_name)




# რომელია სწორი და რატომ:

#print("Hello World!')
#print('Hello' World!')
#print("Hello World")
# სწორი არის ("hello world") რადგან ტექსტი მთლიანად მოქცეულია ერთნაირ ბრჭალებში არ არის შცდომა.


# შექმენით 3 ცვლადი, თითოეულში შეინახეთ სასურველი რიცხვი. შემდეგ შექმენით ახალი ცვლადი, სადაც შეინახეთ ამ 3 რიცხვის საშუალო არითმეტიკულს და დაბეჭდეთ ის.

num1= 20
num2= 30
num3= 40

average=(num1+ num2+ num3)
print(average)