 # მომხმარებელს შემოატანინეთ მისი ასაკი და სახელი, შემდეგ if/else-ის გამოყენებით შეამოწმეთ არის თუ არა ის სრულწლოვანი და უდრის თუ არა მისი სახელი თქვენს სახელს.(შემოწმების შედეგიდან გამომდინარე დაბეჭდეთ True/False) 

name = input("შეიყვანე შენი სახელი: ")
age = int(input("შეიყვანე შენი ასაკი: "))
 

my_name = "ანანო"
 
if age >= 18:
     print("სრულწლოვანი ხარ? ->", True)
else:
     print("სრულწლოვანი ხარ? ->", False)
 
if name == my_name:
     print("შენი სახელი ჩემსას ემთხვევა? ->", True)
else:
     print("შენი სახელი ჩემსას ემთხვევა? ->", False)
 
#2) მომხმარებელს შემოატანინეთ სახელი და თუ ის თქვენს სახელს ემთხვევა დაბეჭდეთ "coincidence"

name = input("შეიყვანე შენი სახელი: ")

my_name = "გიორგი"

if name == my_name:
    print("coincidence")

#3) მოხმარებელს შემოატანინეთ გამოცდის ქულა და შეინახეთ score ცვლადში ინტეჯერად,
# თუ ქულა მეტია 70-ზე დაუბეჭდეთ
#რომ გამოცდა გადალახა "passed" სხვა შემთხვევაში კი რომ ჩაიჭრა "failed"

score = int(input("შეიყვანე გამოცდის ქულა: "))

if score > 70:
    print("passed")
else:
    print("failed")

#4) მომხმარებელს შემოატანინეთ ქულა score და შეინახეთ ცვლადში, როგორც integer.
#შემდეგ, ქულის მიხედვით განსაზღვრეთ შეფასება (grade):
#A  თუ score მეტია 80-ზე
#B  თუ score მეტია 60-ზე
#C  თუ score მეტია 40-ზე
#D  თუ score მეტია 20-ზე
#F  თუ score 20-ზე ნაკლებია


score = int(input("enter your score:") ) 

if score > 80 :
     grade = "A"
elif score > 60 :
     grade = "B"
elif score > 40 : 
     grade = "C"
elif score > 20 : 
     grade = "D"
else:
     grade = "F"
      
     print ("your grade :" ,grade )

#5) კომენტარებით ახსენით რა არის Algorithm-ი. მ
# ოიყვანეთ ალგორითმის მაგალითი რეალური ცხოვრებიდან.

# ალგორითმი არის მკაფიო და დალაგებული ინსტრუქციების (ნაბიჯების) ნაკრები,
# რომელიც გარკვეული ამოცანის გადაჭრისკენ არის მიმართული.
# მარტივად რომ ვთქვათ: ალგორითმი = ნაბიჯ-ნაბიჯ გეგმა 

