# 1) შექმენით ფუნქცია, რომელიც იღებს სამ რიცხვს და აბრუნებს ამ რიცხვებს შორის ყველაზე დიდს. 
def max_of_three(a, b, c):
    return max(a, b, c)

print(max_of_three(5, 12, 7))  

# 2) შექმენით ფუნქცია, რომელიც მიიღებს სიტყვას და დააბრუნებს მისი ასოების რაოდენობას.
def letter_count(word):
    return len(word)

print(letter_count("სიყვარული"))      

# 3) შექმენით ფუნქცია, რომელიც მიიღებს რაღაც რიცხვს, ამის შემდეგ კი დააბრუნებს ამ რიცხვის კვადრატულ მნიშვნელობას.
def square_number(num):
    return num ** 2

print(square_number(6))              

# 4) შექმენით ფუნქცია, რომელიც მიიღებს 3 რიცხვს, თქვენი დავალებაა დააბრუნოთ ამ სამი რიცხვის ნამრავლი.
def multiply_three(a, b, c):
    return a * b * c

print(multiply_three(2, 3, 4))       

# 5) შექმენით ფუნქცია, რომელიც იღებს ერთ რიცხვს და აბრუნებს "დადებითია" თუ რიცხვი დადებითია, "უარყოფითია" თუ რიცხვი უარყოფითია და "ნულია" თუ შესაბამისად რიცხვი ნულის ტოლია.

def number_type(num):
    if num > 0:
        return "დადებითია"
    elif num < 0:
        return "უარყოფითია"
    else:
        return "ნულია"
     
print(number_type(-5))               