# 1) შექმენით 5 ელემენტიანი სია. for ციკლის მეშვეობით მომხმარებელს შემოატანინეთ კიდევ 5 რიცხვი და თითოეული შემოტანილი რიცხვი .append ფუნქციის მეშვეობით ჩაამატეთ არსებულ სიაში. საბოლოოდ დაბეჭდეთ ეს სია

numbers = [1, 2, 3, 4, 5]

for i in range(5):
    number = int(input("შეიყვანე რიცხვი: "))
    numbers.append(number) 

print("საბოლოო სია:", numbers)


# 2) იგივე სიაში მე-3 და მე-4 ელემენტებს შორის ჩასვით თქვენი სახელი. მე-5 ინდექსზე ჩაამატეთ თქვენი ასაკი. სიის თავში ჩაამატეთ თქვენი სიმაღლე. სიის ბოლოში კი თქვემი საყვარელი რიცხვი. საბოლოოდ დაბეჭდეთ ეს სია
# საწყისი სია (10 ელემენტამდე გაზრდილი წინა დავალებიდან)
numbers = [1, 2, 3, 4, 5]

for i in range(5):
    number = int(input("შეიყვანე რიცხვი: "))
    numbers.append(number)

numbers.insert(3, "ანანო") 
numbers.insert(5, 16)  
numbers.insert(0, 172)
numbers.append(7) 
print("განახლებული სია:", numbers)
