# 1) კომენტარებით ახსენით რა არის არგუმენტი, range ფუნქცია და რა ხდება მაშინ, როდესაც მას გადაეცემა ერთი, ორი ან სამი არგუმენტი.

# არგუმენტი არის ისეთი მონაცემი, რომელიც გადაეცემა ფუნქციას მისი შესრულების მიზნით.
# range(start, stop)
#   - როდესაც გადაეცემა ორი არგუმენტი, პირველი არის დაწყების მნიშვნელობა (start), ხოლო მეორე არის დასაჩერებელი მნიშვნელობა (stop).


# 2) დაითვალეთ რამდენი ლუწი რიცხვია 1-დან 50-ის ჩათვლით(გამოიყენეთ for loop-ი)

count = 0 

for number in range(1, 51):  
    if number % 2 == 0:  
        count += 1  

print("ლუწი რიცხვების რაოდენობა 1-დან 50-ის ჩათვლით არის:", count)


# 3) დაბეჭდეთ 1-დან 100-მდე ყველა ლუწი რიცხვის საშუალო არითმეტიკული. გამოიყენეთ for loop-ი.(დაგჭირდებათ ორი ცვლადის შექმნა, ერთში შეინახავთ ჯამს, მეორეში რაოდენობას)

for number in range(1, 100+1):
    if number % 2== 0:
        count += 1
        print ("1-დან 100-მდე ლუწი რიცხვების საშუალო არითმეტიკულია:", count)

# 4) დაბეჭდეთ ყველა რიცხვი 1-დან 30-მდე, რომელიც იყოფა 3-ზე(გამოიყენეთ for loop-ი)
for number in range(1, 30+1):
    if number % 3 == 0:
        print(number)      


# 5) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ მიღებული რიცხვის ყველა გამყოფი(გამოიყენეთ for loop-ი)
number=int(input("შეიყვანეთ ციფრი:"))
print(number)

for i in range(1,number + 1):
    if number % i == 0:
        print(i)


# 6) დაწერეთ პროგრამა, რომელიც მომხმარებელს შემოატანინებს რიცხვს და დაბეჭდავს ეს რიცხვი დადებითია, უარყოფითია თუ 0-ია
number = float(input("შეიყვანეთ რიცხვი: "))  

if number > 0:
    print("რიცხვი დადებითია.")
elif number < 0:
    print("რიცხვი უარყოფითია.")
else:
    print("რიცხვი არის 0.")
 

# 7) დაწერეთ პროგრამა, რომელიც მომხმარებელს შემოატანინებს წელს და გაიგებს არის თუ არა ის ნაკიანი(წელი როდესაც თებერვალში 29 დღე გვაქვს). ნაკიანი არის წელი თუ ის იყოფა 4-ზე და არ იყოფა 100-ზე ან იყოფა 400-ზე.(გამოიყენეთ and და or ოპერატორები)

year = 2016

if year % 4 == 0 and year % 400 != 0:
    print(True)
else:
    print(False)