# 1) შექმენით 5 ელემენტიანი სია. გადაუარეთ მას for ციკლით და დაბეჭდეთ მისი თითოეული ელემენტი
Nums=[1,2,3,4,5,]
for i in Nums:
    print(i)
# 2) შექმენით ცვლადი სადაც შეინახავთ ნებისმიერ წინადადებას. გადაუარეთ for ციკლით მას და დაბეჭდეთ წინადადების თითოეული სიმბოლო
names = ["anano", "lizi", "anamaria", "zizi"]

for name in names:         
    for char in name:      
        print(char)
    print()           

# 3) პირველ დავალებაში შექმნილ სიას გადაუარეთ while ციკლის გამოყენებით.(მინიშნება: დაგჭირდებათ ცვლადის შექმნა, რომელსაც გაზრდით ყოველი იტერაციისას და გამოიყენებთ სიის ინდექსებზე წვდომის მისაღებად)
names = ["anano", "lizi", "anamaria", "zizi"]

i = 0                      
while (names):     
    print(names[i])        
    i += 1                 
