#კომენტარებით ახსენით რა არის input/output-ი და მოიყვანეთ მათი მაგალითები.
#Input ეს არის მონაცემები, რომლებსაც პროგრამა მომხმარებლისგან ან 
# სხვა წყაროდან იღებს. მაგალითად, კლავიატურით შეყვანილი ტექსტი, ფაილიდან
#  წაკითხული ინფორმაცია ან სენსორიდან მიღებული მონაცემები.

#Output ეს არის მონაცემები, რომლებსაც პროგრამა ამუშავებს და აჩვენებს
# მომხმარებელს. მაგალითად, ეკრანზე დაბეჭდილი ტექსტი, ფაილში ჩაწერილი ინფორმაცია 
# ან პრინტერზე გაშვებული დოკუმენტი.

name = input("შიყვანეთ თქვენი სახელი: ")
print("hello",name)

#მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადში, მოახდინეთ მათი კონკადინაცია და დაბეჭდეთ
word1 = input("შეიყვანეთ პირველი სიტყვა: ")
word2 = input("შეიყვანეთ მეორე სიტყვა: ")
result = (word1 + " " + word2)
print("შეკავშირებული სიტყვა:", result)

#მომხმარებელს შემოატანინეთ 5 რიცხვი და დაბეჭდეთ მათი საშუალო არითმეტიკული.
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
num3 = float(input("შეიყვანეთ მესამე რიცხვი: "))
num4 = float(input("შეიყვანეთ მეოთხე რიცხვი: "))
num5 = float(input("შეიყვანეთ მეხუთე რიცხვი: "))

average = (num1 + num2 + num3 + num4 + num5) / 5
print("რიცხვების საშუალო არითმეტიკული არის:", average)

#მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და მათი გამოყენებით დაბეჭდეთ წინადადება.
name = input("შეიყვანეთ თქვენი სახელი: ")
surname = input("შეიყვანეთ თქვენი გვარი: ")
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
height = float(input("შეიყვანეთ თქვენი სიმაღლე (მეტრებში): "))
weight = float(input("შეიყვანეთ თქვენი წონა (კილოგრამებში): "))

print(f"გამარჯობა, მე ვარ {name} {surname}, {age} წლის. ჩემი სიმაღლეა {height} მეტრი, ხოლო წონა {weight} კილოგრამი.")

