#1) შეასრულეთ 3-3 მაგალითი თითოეულ შედარების ოპერატორზე
print(2<4)
print(4<10)
print(33<22)

print(44>33)
print(55>100)
print(9>3)

print(33>=33)
print(95>=44)
print(0>=0)

print(45<=46)
print(89<=90)
print(90<=100)

print(100==100)
print(222==222)
print(11==11)

print(23!=23)
print(44!=44)
print(87!=87)
# შექმენით ცვლადი, სადაც შეინახავთ თქვენს სახელს.
#  შემდეგ მომხმარებელს შემოატანინეთ თავისი სახელი და თუ 
# თქვენი სახელი ემთხვევა მისას, დაბეჭდეთ True, სხვა შემთხვევაში False.

name="anano"
input=input("enter youe name : ")
print(input == name)
